{
  "translation": {
    "Home": "Heim",
    "Expertise": "Sachverstand",
    "Experience": "Erfahrung",
    "Repositories": "Repositories",
    "My tech stack": "Mein Tech-Stack",
    "My Personal Projects": "Meine persönlichen Repositories",
    "Checkout my codes at Github": "Schauen Sie sich meine Codes bei Github an ",
    "Filter projects by frameworks & types": "Filtern Sie Projekte nach Frameworks und Typen",
    "Browse all": "Alle durchsuchen",
    "Sending message to @Ranjeet": "Sende eine Nachricht an @Ranjeet",
    "First name": "Vorname",
    "Last name": "Nachname",
    "Contact number": "Kontakt Nummer",
    "Your email address": "Ihre E-Mail-Adresse",
    "Subject": "Thema",
    "Short description (Optional)": "Kurzbeschreibung (optional)",
    "Send": "Schicken",

    "home": {
      "greeting": "Hallo da!",
      "i'm": "Ich bin",
      "Ranjeet": "Ranjeet Kumar",
      "description": {
        "one": "Ich bin ein dynamischer Mensch, der die Welt der Technologie nahtlos mit einer Leidenschaft für Abenteuer verbindet. Als erfahrener Softwareentwickler kann ich auf eine beeindruckende Erfolgsbilanz bei der Entwicklung innovativer Lösungen und dem Schreiben von sauberem, effizientem Code zurückblicken. Aber ich bin nicht nur auf den Bereich der Computer beschränkt.",
        "two": "Im Herzen bin ich ein wahrer Reisender und Entdecker. Ich bin über Kontinente gereist, in verschiedene Kulturen eingetaucht und durch einige der atemberaubendsten Landschaften der Welt navigiert. Egal, ob ich durch abgelegene Bergketten wandere, in die Tiefen des Ozeans eintauche oder geschäftige städtische Umgebungen erkunde, ich bringe bei jedem neuen Abenteuer die gleiche Neugier und die gleichen Fähigkeiten zur Problemlösung mit.",
        "three": "Ich verbinde technisches Fachwissen mit der Liebe zum Entdecken und suche ständig nach neuen Horizonten, sowohl in der digitalen Welt als auch darüber hinaus. Diese einzigartige Erfahrungsmischung bereichert nicht nur mein Berufsleben, sondern fördert auch ein tiefes Verständnis für die Vernetzung unserer Welt."
      },
      "new-description": "Ich bin ein erfahrener Entwickler mit Fachkenntnissen in der Frontend- und Fullstack-Entwicklung sowie Erfahrung in einer Vielzahl von Projekten und Frameworks. Ich habe eng mit Engineering-Teams zusammengearbeitet, um B2B-Portale sowie verschiedene nationale und europäische Projekte zu entwickeln und zu verbessern. Als unabhängiger Berater habe ich erfolgreich SEO-optimierte Websites und Anwendungen entwickelt und optimiert, die messbare Ergebnisse liefern. Jeder Tag bringt neue Chancen, zu lernen, zu wachsen und Exzellenz zu erreichen, und ich gehe Herausforderungen mit einer positiven Einstellung an.",
      "glance": "🧐 Informationen auf einen Blick"
    },
    "Innovative & Solution-Driven": " Innovativ & Lösungsorientiert",
    "Adaptable | Forward-Thinking": "Anpassungsfähig | Zukunftsorientiert",
    "Problem-Solver | Team Player": "Problemlöser | Teamplayer",

    "Programming": "Programmierung",
    "Soft Skills": "Soft Skills",
    "Engineering Practices": "Ingenieurpraktiken",
    "Experiences": "Erfahrung",
    "Academics": "Akademiker",
    "My Interest": "Meine Interessen",
    "HTML5,": "HTML5,",
    "CSS3,": "CSS3,",
    "SCSS,": "SCSS,",
    "React & Redux,": "React & Redux,",
    "Vue & VueX,": "Vue & VueX,",
    "Angular & RxJs,": "Angular & RxJs,",
    "Express.js,": "Express.js,",
    "Firebase,": "Firebase,",
    "PostgreSQL,": "PostgreSQL,",
    "Cypress,": "Cypress,",
    "ESLint,": "ESLint,",
    "Bootstrap,": "Bootstrap,",
    "Tailwind,": "Tailwind,",
    "Git,": "Git,",
    "& more...... ": "& mehr......",
    "- Strong problem-solving abilities.": "- Starke Problemlösungsfähigkeiten.",
    "- Excellent communication and teamwork skills.": "- Hervorragende Kommunikations- und Teamfähigkeit.",
    "- Ability to work effectively in multicultural environments.": "- Fähigkeit, effektiv in multikulturellen Umgebungen zu arbeiten.",
    "- Adaptability and willingness to learn new technologies.": "- Anpassungsfähigkeit und Bereitschaft, neue Technologien zu erlernen.",
    "- Accessibility in HTML / CSS.": "- Barrierefreiheit in HTML / CSS.",
    "- Estimation and work planning.": "- Schätzung und Arbeitsplanung.",
    "- Web performance optimization.": "- Web-Performance-Optimierung.",
    "- Cross-browser testing & Web animations.": "- Cross-Browser-Tests und Web-Animationen.",
    "- Ability to troubleshoot and resolve issues efficiently.": "- Fähigkeit, Probleme effizient zu beheben.",
    "- A dynamic and seasoned software developer with 7.5 years of experience in creating responsive, user-friendly web-applications (SPA) and websites.": "- Ein dynamischer und erfahrener Softwareentwickler mit 7,5 Jahren Erfahrung in der Erstellung reaktionsschneller, benutzerfreundlicher Webanwendungen (SPA) und Websites.",
    "- BA-Prog. -Delhi University.": "- BA-Prog. -Universität Delhi.",
    "- G.B Senior Secondary School, New Delhi.": "- G.B Senior Secondary School, Neu-Delhi.",
    "Yoga,": "Yoga,",
    "Martial Arts,": "Kampfsport,",
    "Tech Podcasts,": "Tech Podcasts,",
    "Tech Conferences,": "Tech-Konferenzen,",
    "Gardening,": "Gartenarbeit,",
    "Cycling,": "Radfahren,",
    "Reading,": "Lesen,",
    "Let's Connect": "Lassen Sie uns verbinden",
    "Show more details": "Weitere Details anzeigen",
    "More Details": "Mehr Details",
    "Click for more details": "Klicken Sie für weitere Details",
    "Email me": "Maile mir",
    "Download my CV": "Mein Lebenslauf",
    "Message me": "Nachricht",
    "Code management": "Codeverwaltung",
    "Design": "Design",
    "design": "Design",
    "managing": "Verwaltung",
    "Tech highlights": "Tech-Highlights",
    "Links": "Links",
    "Live Demo": "Live-Demo",
    "Source Code": "Quellcode",
    "My Github": "Mein Github",
    "Return": "Zurückkehren",
    "Click on imgae to zoom / shrink": "Klicken Sie auf das Bild, um es zu vergrößern/verkleiner",
    "Last updated": "Letzte Aktualisierung",
    "Related projects": "Ähnliche Projekte",

    "Parental Break": "Elternzeit",
    "Frontend Developer-XLAB doo": "Frontend-Entwickler bei XLAB doo",
    "Soft Smart Services": "Soft Smart Services",
    "In Technologies": "In Technologies",
    "Visited India after 4 years.": "Nach 4 Jahren Indien besucht.",
    "learned Slovene language and Passed A1 level test.": "Slowenisch gelernt und A1-Test bestanden.",
    "Making some independent projects , for details checkout my Github.": "Unabhängige Projekte erstellt, Details auf meinem Github.",
    "Supported and took care of my wife and welcomed a new family member.": "Meine Frau unterstützt und ein neues Familienmitglied willkommen geheißen.",
    "Contributed to development of responsive enterprise-level web applications using VueJs and Angular in a team of 3 engineers.": "Entwicklung von responsiven Webanwendungen auf Unternehmensebene mit VueJs und Angular in einem Team von 3 Ingenieuren beigetragen.",
    "Independently collaborated with designers and backend developers to implement pixel-perfect UI designs and integrate backend APIs.": "Unabhängig mit Designern und Backend-Entwicklern zusammengearbeitet, um pixelgenaue UI-Designs zu implementieren und Backend-APIs zu integrieren.",
    "Optimized application performance by implementing code-splitting, lazy loading, and other performance optimization techniques.": "Optimierung der Anwendungsleistung durch Implementierung von Code-Splitting, Lazy Loading und anderen Performance-Optimierungstechniken.",
    "Contributed to the development of reusable UI components to improve development efficiency and maintain consistency across the application.": "Entwicklung wiederverwendbarer UI-Komponenten zur Verbesserung der Entwicklungseffizienz und zur Aufrechterhaltung der Konsistenz in der gesamten Anwendung beigetragen.",
    "Independently migrated company's website from WordPress (PHP templating) to Hugo (Golang templating) and contributed to Django backend.": "Unternehmenswebsite eigenständig von WordPress (PHP-Templating) auf Hugo (Golang-Templating) migriert und zum Django-Backend beigetragen.",
    "Worked closely with QA team to identify and fix bugs.": "Eng mit dem QA-Team zusammengearbeitet, um Fehler zu identifizieren und zu beheben.",
    "Independently developed and managed the frontend code using the React framework.": "Eigenständig das Frontend mit dem React-Framework entwickelt und verwaltet.",
    "Developed websites using Html, CSS, bootstrap, JavaScript, jQuery, PHP and SQL.": "Websites mit Html, CSS, Bootstrap, JavaScript, jQuery, PHP und SQL entwickelt.",
    "Created and suggested website designs.": "Website-Designs erstellt und vorgeschlagen.",
    "Made SEO friendly websites.": "SEO-freundliche Websites erstellt.",
    "Manage website backend and hosting": "Website-Backend und Hosting verwaltet",
    "Software troubleshooting support for USA/CA/Britain clients.": "Software-Fehlerbehebung für Kunden in den USA/Kanada/Großbritannien.",
    "December 2023 - Current": "Dezember 2023 – Aktuell",
    "June 2022 - 1st Dec 2023": "Juni 2022 – 1. Dezember 2023",
    "Aug 2015 - Dec 2021": "August 2015 – Dezember 2021",
    "Apr 2013 - 2014": "April 2013 – 2014",
    "Activities & Responsibilities": "Aktivitäten und Verantwortlichkeiten",
    "Used tech stack": "Gebrauchter Tech-Stack",
    "experienceDetails": {
      "one": "Meine Reise als Programmierer begann in der Schule, wo ich die Grundlagen der Webentwicklung und Datenbanken erlernte. Dieses frühe Fundament legte den Grundstein für meine Studienjahre, in denen ich meine Fähigkeiten weiter verfeinerte, insbesondere in der C++-Programmierung.",
      "two": "Als leidenschaftlicher Naturwissenschaftler und Technik-Enthusiast war es schon immer mein Ziel, in der Technologiebranche zu arbeiten. Meine berufliche Laufbahn begann offiziell als Customer Support Engineer, wo ich praktische Erfahrungen bei der Lösung technischer Herausforderungen sammelte. Diese Rolle markierte den Beginn meines stetigen Wachstums in der Technologie.",
      "three": "Anschließend wechselte ich in die Freiberuflichkeit, wo ich mit Kunden aus verschiedenen Ländern an einer Vielzahl von Projekten arbeitete. Diese Erfahrung ermöglichte es mir, meine technischen Fähigkeiten zu schärfen, mich an unterschiedliche Herausforderungen anzupassen und als vielseitiger Programmierer zu wachsen.",
      "four": "Mit über 7,5 Jahren Berufserfahrung habe ich Expertise in der Entwicklung und Optimierung von Webanwendungen unter Verwendung moderner Technologien wie React, Vue, Angular, Express.js und PostgreSQL entwickelt. Meine Karriere umfasst sowohl die unabhängige Freiberuflichkeit als auch die Zusammenarbeit in Unternehmen, was es mir ermöglicht, einen flexiblen Ansatz in jedes Projekt einzubringen.",
      "five": "Als Freiberufler habe ich komplette Projektlebenszyklen von der Konzeptphase bis zur finalen Auslieferung erfolgreich gemanagt und dabei stets die Erwartungen der Kunden übertroffen und messbare Ergebnisse erzielt. Meine Arbeit umfasste häufig die Entwicklung und Optimierung von SEO-freundlichen Websites und Anwendungen, um sowohl in der Benutzererfahrung als auch im Suchmaschinenranking Spitzenleistungen zu erzielen.",
      "six": "In Unternehmensumgebungen habe ich eng mit Engineering-Teams zusammengearbeitet, um B2B-Portale und andere Projekte mit hoher Reichweite zu entwickeln und zu verbessern. Darüber hinaus habe ich zu verschiedenen nationalen und europäischen Initiativen beigetragen, indem ich meine technische Expertise und mein Engagement für Qualität eingesetzt habe, um den Projekterfolg sicherzustellen.",
      "seven": "Als unabhängiger Berater habe ich skalierbare, wartbare und leistungsstarke Webanwendungen geliefert, die oft die Ziele der Kunden übertroffen haben. Meine Fähigkeit, effiziente, ergebnisorientierte Lösungen zu schaffen, war entscheidend für meinen anhaltenden Erfolg als Programmierer und Berater."
    },

    "My Expertise": "Meine Expertise",
    "Secret code for downloading CV": "Geheimcode zum Herunterladen des Lebenslaufs",
    "Thanks for confirming, downloading should start in few seconds. Please check download forlder.": "Vielen Dank für die Bestätigung. Der Download sollte in wenigen Sekunden beginnen. Bitte überprüfen Sie den Download-Ordner.",
    "Submit secret code": "Geben Sie den Geheimcode ein",
    "Please provide secret code to download my CV": "Bitte geben Sie einen Geheimcode ein, um meinen Lebenslauf herunterzuladen",
    "Close": "Schließen",
    "secret code": "Geheimcode",

    "Music Wallets (vue 3)": "Musik-Wallets (vue 3)",
    "Group Chat (vue 3)": "Gruppenchat (vue 3)",
    "Github Repo browser (Angular)": "Github Repo-Browser (Angular)",
    "Appointment tracker (Angular)": "Terminverfolger (Angular)",
    "Portfolio (React)": "Portfolio (React)",
    "Quiz App (React)": "Quiz-App (React)",
    "React-Text to Speech (React)": "React-Text zu Sprache (React)",
    "Simple Counter (vue 2)": "Einfacher Zähler (vue 2)",
    "Keeper App (React)": "Keeper-App (React)",
    "Movie Database (React)": "Filmdatenbank (React)",
    "Contact Manager (React)": "Kontaktmanager (React)",
    "Drone Company (React)": "Drohnenunternehmen (React)",
    "React-Website (React)": "React-Website (React)",
    "React Dynamic Menu (React)": "React Dynamisches Menü (React)",
    "To-do-app": "To-do-App",
    "Weathe App": "Wetter-App",
    "QR-Code Generator": "QR-Code-Generator",
    "Personality Match": "Persönlichkeits-Match",
    "Weight converter": "Gewichtskonverter",
    "Music player": "Musikspieler",
    "Counter": "Zähler",
    "Digital clock": "Digitale Uhr",
    "Tap the music": "Tippen Sie auf die Musik",
    "Menu display -filter": "Menüanzeige -Filter",
    "Best pictures from Europe": "Beste Bilder aus Europa",
    "Dice Game": "Würfelspiel",
    "Av-st-Template": "Av-st-Vorlage",
    "Form validation": "Formularvalidierung",
    "Yoga-demo": "Yoga-Demo",
    "Tech-demo": "Technik-Demo",
    "Car service demo": "Autoreparatur-Demo",
    "Animated Boat": "Animiertes Boot",

    "Login with your email and password and create your playlist, add your favorite YouTube music videos to your playlist and watch your music video anytime. Saves your time in browsing your favourite music. You can also browse and listen to the music playlist made by other members. You can delete and add as many videos as you wish on your account. If you have no account then start with sign-up. This app does not save any data to browser memory.": "Melden Sie sich mit Ihrer E-Mail und Ihrem Passwort an und erstellen Sie Ihre Playlist, fügen Sie Ihre Lieblings-YouTube-Musikvideos zu Ihrer Playlist hinzu und sehen Sie sich Ihre Musikvideos jederzeit an. Spart Ihnen Zeit beim Durchsuchen Ihrer Lieblingsmusik. Sie können auch die Musik-Playlisten anderer Mitglieder durchsuchen und anhören. Sie können beliebig viele Videos zu Ihrem Konto hinzufügen und löschen. Wenn Sie kein Konto haben, beginnen Sie mit der Registrierung. Diese App speichert keine Daten im Browser-Speicher.",
    "cookies": "Wir verwenden Cookies, um sicherzustellen, dass Sie die beste Erfahrung auf unserer Website machen. Wenn Sie weiterhin auf dieser Seite bleiben, stimmen Sie der Verwendung von Cookies zu.",
    "Accept all": "Akzeptiere alle",
    "Only necessary": "Nur notwendig",
    "Now displaying list of": "Jetzt wird eine Liste von",
    "repositories, for more repositories checkout my": "Repositories angezeigt, für weitere Repositories besuchen Sie mein"
  }
}
